In [38]:
import pandas as pd
import numpy as np
df = pd.read_csv("data.csv")

C:\Users\jpo-0\AppData\Local\Temp\ipykernel_15460\3940270650.py:3: DtypeWarning: Columns (0,4,5,6,7) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("data.csv")

In [39]:
df.duplicated().sum()
df.duplicated(subset='Id').sum()

0

In [40]:
df['AverageSalary'] = df[['LowestSalary', 'HighestSalary']].mean(axis=1)

In [41]:
# df.duplicated().sum()
df.duplicated(subset='Id').sum()

0

In [45]:
df['Id'] = df['Id'].replace(to_replace=r'(?<=\d{8}).*', regex=True, value='')

df['Date'] = df['Date'].replace(to_replace=r'(?<=^\d{4}-\d{2}-\d{2}).*', regex=True, value='')

df["Date"] = pd.to_datetime(df["Date"])

df["Id"] = pd.to_numeric(df["Id"])
df.duplicated(subset='Id').sum()

14165

In [46]:
df = df.drop_duplicates()

In [64]:
# df.duplicated(subset='Id').sum()
# df.loc[df.duplicated(subset='Id')]
# df.head()
df.loc[df['Id'] == 37706841]

,Id,Title,Company,Date,Location,Area,Classification,SubClassification,Requirement,FullDescription,LowestSalary,HighestSalary,JobType,AverageSalary
152403,37706841,Administrator & Accounts Manager,Rose Litigation Lawyers,2018-11-13,Brisbane,CBD & Inner Suburbs,Legal,Legal Practice Management,An Administration & Accounts manager is requir...,<p>An exciting opportunity has arisen due to t...,0,30,Full Time,15.0
154799,37706841,Administrator & Accounts Manager,Rose Litigation Lawyers,2018-12-11,Brisbane,CBD & Inner Suburbs,Legal,Legal Practice Management,An Administration & Accounts manager is requir...,NaN,0,30,NaN,15.0